{
  "configurations": {
    "wikiLangName": "en",
    "docTitle": "Code Name"
  },
  "gameRules": {
    "title": "The Game's Rules and Instructions",
    "concept": {
      "title": "Game's Concept",
      "content": "A group game of verbal reasoning and creativity."
    },
    "beginningTheGame": {
      "title": "Starting the Game",
      "firstInstructions": "Divide into two equal teams: a red team and a blue team.\nEach team selects a representative from within it to be its captain.\nThe two captains sit on one side of the room, while the rest of the team members sit on the other side.",
      "selectDeck": "Choose a deck of cards that suits you:\nFamily: cards with simple words for children to understand.\nAdults: cards with slightly more complicated words suitable for adult players.\nGo Nuts: random values from Wikipedia, for a complex and amusing game.",
      "customizeDeck": "Before starting the game, you can always replace words that do not suit you by pressing the replacement button in the upper right corner of the card.\nThe button will appear when you hover over the card with the mouse.",
      "startGame": "Once the cards that are laid out are to your liking, press the 'Start Game' button.",
      "captainsLogin": "Now the two captains need to log in to the game:\nThis can be done from any device: mobile phone, tablet, or computer.\nLogging into the game as a captain is done by scanning the QR-code or browsing to the displayed address and entering the game code.",
      "gameBegins": "Once the two captains have logged in, the game begins.\nThe first team to play is the blue team, as it has one more word to guess than the red team."
    },
    "captainsRole": {
      "title": "The Captain Role",
      "captainsView": {
        "explanation": "The captain sees the cards slightly differently from the other team members, as shown here:",
        "teamAscription": "The red cards are assigned to the red team, the blue ones to the blue team, and those with a neutral background are not assigned to any team.",
        "bomb": "As you've probably noticed, there is one card with a purple frame and an icon of a bomb in the corner. This is the bomb card, and its role will be explained later."
      },
      "goal": "The captain's goal is for his team to discover all the cards associated with his team before the opposing team discovers their cards.\nThe first team to discover all its cards wins the game.",
      "turn": "Each captain, in his turn, is allowed to give his team a code word and a number.\nThe code word represents a connection between several words that the captain hopes his team will guess.\nThe number represents how many words they need to guess. For example:",
      "example": "In this situation, the captain of the blue team can say to his team: 'Cream, 3'.\nHe hopes that his team will find the three blue words that match 'cream':\nFrosting, which is made from cream,\nCake, in which cream is often found as one of the ingredients,\nand Cat, an association arising from the phrase: 'leaving the cat to guard the cream'.\nThe captain can only hope that his team will indeed guess these three words, as even the neutral word 'kitchen' fits the cream association.",
      "number": "As mentioned, the number the captain gives along with the code word represents how many words his team needs to guess in the current turn.\nThere is no limit to the number of words: you can also hint at a single word, although this would pose the risk of the opposing team progressing faster towards victory.\nIt is better to go for two or three words. Four words and above is not for the faint-hearted and deserves appreciation.",
      "restrictions": {
        "title": "Code Word Restrictions",
        "oneWord": "The code word must be a single word.",
        "inflections": "The code word is not allowed to be an inflection of any of the words in the game.",
        "contained": "The code word is not allowed to be contained within the words to which the captain hints, for example: 'house' is an invalid hint for the word 'guesthouse'. In fact, in this case, the word 'house' is an invalid code word even if the captain's intention is to hint at other words on the board.",
        "indexReferencing": "The code word is not allowed to refer to the location of the word on the board. For example, you can give the word 'corner' as a code word if it refers to words like 'around' or 'stone', but not if the captain intends to refer to the word located in the corner of the board.",
        "spelling": "The code word is not allowed to be based on spelling. For example, 'g, 3' is an invalid hint for the words 'genius', 'golf', and 'grief'.",
        "language": "Foreign language words are not allowed, unless they are commonly used in English, such as: 'alfresco', 'ad nauseam', or 'deja vu'.",
        "leadingGestures": "The captain isn't allowed to add comments, such as: 'this will be tricky...', or: 'try to think like Tommy'. Nor can he add physical gestures.",
        "pokerFace": "The captain is expected to maintain a poker face when his team is deliberating which words to choose."
      },
      "violation": "If the captain gives an invalid code word, the turn passes immediately to the other team. Be sure to press the 'Forfeit Turn' button so that the game can keep track of which team's turn is it.",
      "otherTeamCard": "If by chance you guessed a card belonging to the opposing team, you've simply granted them a free point.\nThe captain should try to steer his team's guesses away from the words associated with the opposing team, but it is easier said than done.",
      "whenBombIsSelected": "If one of the cards your team guessed is the one marked with the bomb, your team loses the game.\nTherefore, it is especially important that the captains take into account that the code word they give is not likely to inadvertently point their team to the bomb."
    }
  },
  "header": {
    "title": "Code Name",
    "routes": {
      "gameRules": "The Rules",
      "about": "About This Project",
      "home": "Home"
    }
  },
  "startScreen": {
    "header": "Welcome to Code Name by Yonch",
    "description": "Select a deck to start the game,\n or go to 'The Rules' in the navbar to learn how to play"
  },
  "loading": {
    "wikisTakeLong": "First time fetching random Wiki values takes between 8-14 seconds,\n but next time it will be instant."
  },
  "error": {
    "message1": "There was some error fetching the data.\nTry again later or",
    "clickHere": " click here ",
    "message2": "to Email Yonch directly about the issue."
  },
  "initGame": {
    "title": "Select a Deck",
    "family": "Family",
    "adults": "Adults",
    "goNuts": "Go Nuts!",
    "startGameBtn": "Start the Game",
    "goNutsPopover": "Random values from Wikipedia"
  },
  "manageGame": {
    "currentTurn": "Current Turn",
    "blueScore": "Blue Team's Score",
    "redScore": "Red Team's Score",
    "submitBtn": "Submit answer",
    "forfeitTurn": "Forfeit Turn",
    "abortBtn": "Abort Game"
  },
  "victory": {
    "blue": "Blue Team Wins!",
    "red": "Red Team Wins!",
    "bomb": "The opposing team have selected the bomb,\nand therefore have lost the game!",
    "cards": "You've revealed all of your cards first\nand therefore have won the game"
  },
  "captainsData": {
    "instructions": "To enter as a captain, scan the barcode.\n Or, alternatively, just go to\nhttp://localhost:5173/captain\non your device and enter the game code.",
    "sessionCode": "Game Code:  "
  },
  "board": {
    "cards": {
      "hoverStatement": "No more info available."
    }
  },
  "gameCard": {
    "replaceBtn": "Replace"
  },

  "captain": {
    "loginScreen": {
      "enterCode": "Enter Game Code",
      "enterGame": "Enter"
    },
    "landscape": "Please shift your device to\nlandscape orientation."
  },
  "about": {
    "title": {
      "title": "About The Project",
      "description": "This is my take on the beloved parlor game Code Name.\nIt is a web-based way for a group of friends or family to play the game.\nBuilt in Node.js and React, this project incorporates many different technologies, techniques and libraries.\nIt supports both English and Hebrew."
    },
    "technologies": {
      "title": "Technologies Used",
      "frontend": {
        "title": "Frontend",
        "typeScript": "typeScript",
        "react": "React",
        "socket": "Socket.io",
        "api": "Wikipedia's REST API",
        "i18n": "i18n",
        "tailwind": "Tailwind CSS",
        "shadcn-ui": "Shadcn-ui"
      },
      "backend": {
        "title": "Backend",
        "node": "Node.js",
        "express": "Express",
        "mySql": "mySQL"
      }
    },
    "repo": {
      "title": "🔗 Project's Repository in GitHub",
      "github": "CodeName-ByYonch"
    },
    "contact": {
      "title": "Contact Me",
      "name": "Jonathan Ribak",
      "email": "yonch.baalil@gmail.com",
      "linkedIn": "LinkedIn",
      "github": "GitHub"
    }
  }
}
